Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: TAPI TOLONG JANGAN
en: But, please don’t

source: INI MEREKA..???
en: Ugh... this is all

source: bandar informasi
en: an informant

source: DIRI DENGAN MENDEKATI
en: by getting close

source: PAK NEV BISA
en: What?!

source: KAK EZRA...?
en: ezra?

source: ADALAH SUMBER
en: a very valuable informant

source: YANG DIA BICARAKAN
en: what she was talking about

source: …Pelakunya sampai melakukan hal seperti ini, artinya pelakunya akan meminta sesuatu yang besar pada kita.
en: for the perpetrator to do this far, they must want a huge favor from us.

source: ATAU PAK NEV SAJA?"
en: who does it?”

source: BICARA KE INTINYA.
en: into it.

source: Malas.
en: Hesitant.

source: PIP.
en: Beep.

source: BERNAMA ERLANGGA?
en: Erlangga?

source: AKU BUKAN ORANG
en: I’m not

source: WALAUPUN TIDAK SAMA PERSIS, AURANYA MIRIP DENGAN PAK NEV!
en: I’ve just realized that his aura is similar to that of mr. nevada!

source: TIDAK PERLU BERSANDIWARA YANG BERLEBIHAN,
en: you won’t have to overact.

source: ITU ADA BENARNYA.
en: was kinda true.

source: SELESAI, KITA
en: this after

source: DENGAN KAKAK.
en: Ezra.

source: KE AUDITORIUM.
en: auditorium.

source: KAMI INGIN MENYELESAIKAN MASALAH INI SAMPAI KE AKARNYA.
en: we wanted to get to the root of the problem.

source: FAMILIAR UNTUK
en: familiar

source: …ADA
en: He told me

source: MENUNGGU DAN MELIHAT
en: stand down and monitor

source: KALAU TIDAK KAK EZRA AKAN MENGGANGGU TERUS.
en: otherwise, he would keep bugging me.

source: PERLU DISELESAIKAN.
en: with right now.

source: DAM SELAIN ITU, KAKAK ADALAH TEMANKU, BUKAN?
en: plus, you’re my friend.

source: DRRTT
en: bzzt

source: KETUA OSIS,
en: the vice

source: AKU TAHU INI
en: I know

source: …Loh!
en: huh?

source: ADA DI PIHAK OSIS.
en: on our side.

source: YA, SAYA
en: Yes, I’ve

source: DARI TADI
en: Stop

source: MARAH??
en: that I’m angry???

source: EEH,
en: Speak

source: DIA ANGGOTA OSIS,
en: because he was a member of OSIS.

source: Aku tidak bisa
en: darn it,

source: APA MUNGKIN SAMA
en: Maybe

source: TANGANKU BERGERAK SENDIRI!!!
en: my hand was moving on its own!

source: BANYAK BICARA.
en: asking too many questions.

source: RASA HORMAT!
en: Naomi!

source: JADI KETUA
en: And

source: DIA TETAP HIDUP??
en: still breathing?!

source: HA...??
en: huh???

source: SEDANG BERUSAHA
en: trying to

source: PADAHAL KITA
en: We’re not

source: SEKARANG
en: Now, it’s time

source: APA ORANG
en: Is this doofus

source: SOAL ANGGOTA ITU
en: I’ll be the one

source: DAN KEMUNGKINAN BESAR, KELUARGA SANJAYA...
en: there’s strong indication that the sanjaya family...

source: seperti itu!
en: like that!

source: KALAU BEGINI
en: At this rate,

source: TAPI KAMU TIDAK BOLEH BIAS DALAM MEMBERI PENILAIAN!!
en: but we should be objective!

source: UNTUK MEMINIMALISIR
en: We did this in order

source: GOTONG ROYONG DAN
en: help us work together

source: AKU BICARAKAN
en: tell you,

source: DARI KETUA OSIS.
en: president.

source: JADI PAK,
en: So, the thing is,

source: SEPERTI ITU, SEJUJURNYA
en: like that, then

source: SUDAH BEGINI, NANTI AKU
en: It can’t be helped, i guess.

source: TEMAN-TEMANKU,
en: were not avoiding me.

source: SESEORANG.
en: someone.

source: TETAP WASPADA
en: to keep an eye

source: selesai latihan pun
en: here even though

source: DAN UNTUK BISA MENGELABUI LAWAN,
en: sometimes, in order to deceive your enemy...

source: DIBAYANGANMU?
en: like in your mind?

source: ASALKAN ORANG
en: as long as they’re nice,

source: CERITAKU?
en: a bit?

source: KITA TANGANI.
en: we’re dealing with right now.

source: SI WAKATOS…
en: scared of her.

source: OSIS HANYALAH
en: OSIS is just

source: KETUA."
en: ...president.”

source: KALAU KALIAN BENAR-BENAR TIDAK PEDULI,
en: if you didn’t care about me,

source: BEGITU,
en: case,

source: A-AKU MENUNGGU
en: I-I’m waiting for

source: SUDAH DENGAR APA
en: heard about

source: WAKATOS BICARA.
en: Chiara.

source: MENJELASKAN PERATURAN
en: how OSIS works

source: RUPANYA KITA
en: we’re

source: SUDAH BERBEDA.
en: is different now.

source: B-BISA...
en: yes, I-I will focus...

source: EH TUNGGU,
en: Wait, you said

source: Memangnya anak SMA sepertimu punya data sepenting apa sih??
en: how important is it for a high-school guy like you?!

source: KELAS YANG DITENTUKAN
en: in an empty classroom,

source: Sebenarnya kita hanya ingin bicara dengan kepsek!
en: actually, we just wanted to talk to the principal!

source: CHIARA SAMPAI
en: her to be close

source: nanti akan kubelikan
en: I’ll buy you anything you

source: HATI MENGKHAWATIRKAN
en: worried about you, ezra!

source: DENGAN KATA LAIN, GAGAL BUKANLAH PILIHAN..!
en: in other words, we can’t fail!

source: ARTINYA MEREKA
en: Does this mean

source: DENGAN KAK LEO TADI
en: to leo, I’ve started to

source: KENAPA...
en: ...why do I...

source: bertindak sebagai
en: responsibility is to

source: BAIKLAH, BAIKLAH.
en: okay, okay.

source: SAMA-SAMA MENJABAT,
en: and are members of OSIS,

source: BISA KITA PAKAI,
en: use this...

source: ini…
en: voice...

source: PERATURANNYA,
en: it up.

source: BERDUA…
en: for you.

source: INFORMASI INI
en: info

source: TAPI BIARPUN
en: But, even though

source: LAIN KALI.
en: sometime.

source: pasti tertipu!
en: him!

source: TIDAK BENAR-BENAR
en: explained to you

source: BAHWA KAMU PUN TIDAK
en: you, too, have no idea

source: NAH, SEKARANG
en: So,

source: AKU MERASA SEPERTI ORANG BODOH, SEMENTARA KALIAN TAHU YANG SEBENARNYA!
en: I feel stupid, and you guys keep hiding the truth from me!

source: BUKAN KARENA ITU.
en: for that.

source: TAPI KEMARIN AKU MALAH MELAKUKAN HAL YANG MEMBENARKAN KEKHAWATIRANNYA ITU!!!
en: however, the other day, I did something that confirmed her fear!

source: setelah sekian lama!
en: after so long!

source: Muka kakak
en: Your

source: KECEWA?
en: should I?

source: kau ungkit??
en: you serious?!

source: BISA TERBENTUK.
en: the same goal.

source: PERTEMUAN KEBETULAN
en: This spontaneous encounter

source: AH, KAKAK
en: Oh, yeah! But, don’t be

source: SEGERA KEMBALI KE
en: get here as soon as possible

source: KAK EZRA DAN
en: Ezra

source: HARI INI LEO
en: Leo

source: HARUSNYA KAU GAK
en: You don’t have a problem

source: NYONYA KEDATANGAN TAMU.
en: ...you have a guest.

source: Ya sudahlah, aku akan kembali ke kelas setelah mereka pergi...
en: well, I’ll go back to the classroom once they leave...

source: SIH BEGITU,
en: thought about it,

source: MEMPERLIHATKAN
en: show

source: APA MAKSUDNYA
en: why did you

source: KENAPA AKU
en: Why am I

source: TAPI ADA JUGA
en: However, there are

source: Penetralisir.
en: the peacemaker.

source: Habisnya tadi Cantika lihat kakak berdua mirip dengan Papa Mama...
en: you two look like mom and dad.

source: JADI SAYA BERTERIMA KASIH JUGA UNTUK INFORMASI INI.
en: also, I’d like to thank you both for this information.

source: COBA PIKIRKAN,
en: Think about it,

source: Eh..?
en: hm?

source: H-HAAHH!??
en: w-what?!!!

source: ANEH.
en: from the beginning.

source: KALAU PERASAAN
en: that my feelings

source: BERGOSIP DI KANTIN KALAU
en: were talking about you when I was in the cafeteria.

source: …TAPI KALAU BEGITU,
en: if that’s the case,

source: DATANG KE TATA
en: the administration

source: NAOMI TAHU
en: It’s already embarrassing

source: ENAKNYA
en: So, what are we

source: Sekretaris II)
en: last term)

source: DIA…
en: he...

source: ITU?
en: that?

source: DAN DIA MEMASANG
en: he had

source: SAJA KEBETULAN,
en: just a coincidence,

source: PERTANYAAN.
en: questions.

source: TADI?
en: what happened?

source: Karena kau
en: Since you’re

source: AKU INGIN
en: I want to

source: INI MENYEBALKAN
en: he really grinds my

source: kok bisa dia
en: how did you

source: kalau pembicaraan mereka
en: that her conversation with Leo

source: SERIUS BEGITU,
en: before.

source: LHO, KAU TIDAK TAHU?
en: don’t you know?

source: MELAKUKANNYA BUKAN
en: I didn’t do it because

source: Cerewet.
en: shut up.

source: oleh anak-anak
en: know

source: MURID TELADAN, RAMAH,
en: is a prodigy. He’s kind and

source: aku pergi dulu!
en: I guess we’re done here.

source: ...BENAR, DIA ANAK YANG UNIK.
en: yeah, she’s quite unique.

source: MENDADAK.
en: notice.

source: BU NINA YANG ASLI…
en: the real Ms. Nina...

source: WAKATOS MARAH PADAMU
en: that she will be furious

source: MAAF
en: I’m

source: Ah, apa mungkin Kakak yang seram itu suka sama Kakak ya?
en: oh, maybe that scary guy likes you?

source: SEPERTI ITU!
en: that, huh?!

source: TANPA TAHU KALAU
en: Leo is a twelfth-grader,

source: TAPI SAYA PERLU
en: But, I need

source: MEREKA
en: Whoa... they

source: ...EH?
en: huh?

source: CURHAT KALAU KAU BARU SAJA MELAKUKAN HAL BODOH LAGI DI DEPAN WAKATOS?
en: just to tell me that you’ve done something stupid again in front of the vice president?

source: MENYEBAR DENGAN
en: around

source: MENYANGKA AKAN
en: that I’d be involved

source: PERMISI?
en: hello?

source: WAKATOS JUGA…
en: we’re talking about chiara...

source: AKU JADI MERASA BERSALAH...
en: now I feel guilty...

source: KAKAK BILANG JANGAN
en: me to be

source: AKU TINGGAL
en: Now, I just

source: NOTIFIKASI?
en: notifications?

source: DIA PASTI MAU
en: Does she

source: TAHU HAL INI…
en: this...

source: KENAPA SAYA
en: that it’ll be best

source: PANJANG
en: of the

source: AKAN MENJELASKAN
en: you’d explain everything

source: merasa
en: feel

source: JIKA KITA KEHILANGAN
en: of her stature from OSIS

source: SANGAT BERHATI-
en: always cautious

source: HAL YANG MUDAH.
en: easy.

source: APA KALIAN TIDAK PERNAH MERASA PAK NEV PUNYA POTENSI MENJADI PENJAHAT?
en: have you ever thought that mr. nevada could actually be the bad guy?

source: DIA.
en: her.

source: KALAU KETAHUAN BAGAIMANA?
en: what if they find out?

source: KEBETULAN SEKALI
en: I’ve just

source: MEMBUATMU
en: disappointed

source: PADAMU.
en: detail.

source: PEMBICARAAN MEREKA.
en: their conversation.

source: Buat apa
en: I don’t

source: TIDAK PERLU
en: you don’t need

source: HP-ku di silent…
en: my phone is in silent mode.

source: BETUL…
en: is blind...

source: BICARAKAN
en: talk this

source: K-KALAU TERNYATA
en: Th-then, what if

source: KARENA ITU,
en: So,

source: NEVADA JUGA TIDAK TERPILIH SEBAGAI WAKASEK TANPA ALASAN.
en: I choose him as a vice principal for a reason.

source: WAKIL KETUA OSIS DIMINTA
en: The vice president

source: CERITA CHIARA,
en: what chiara told me,

source: KALAU DENGANKU
en: I mean it’s fine

source: IYA, MAKANYA
en: I told you,

source: Ke kantin
en: Wanna

source: SEMUA ORANG DI SINI
en: everyone knows

source: KATA KETUA TEATERMU
en: Leo said

source: Kenapa sih
en: Why have you been

source: DIA LAKUKAN.
en: just did.

source: BEGINI…
en: before...

source: PEMBICARAAN KITA
en: our conversations

source: PIP
en: Beep

source: KITA HARUS BEGINI?
en: do we have to suffer like this?!

source: AKU PINJAMKAN
en: in the mirror,

source: AKU INI SENIOR
en: I’m a senior for pete’s sake!

source: BISA?
en: do it, Ezra?

source: BENAR!!!
en: you’re right!

source: MELAKUKAN INI?
en: doing this?

source: Bukan salah Kak Chia kok, mereka yang nakal…
en: it’s not your fault! they’re the bad guys!

source: CAPEKNYA!
en: I’m exhausted!

source: EEEH!??
en: huh?!

source: TAPI AKU AKAN TETAP CARI TAHU, SEKALIGUS MENAMBAH PENGETAHUAN TENTANG PAK NEV.
en: but I’m still going to dig up some details because I wanna learn more about mr. nevada.

source: CK!
en: Tsk

source: TERLALU TIBA-
en: I’m having a hard time processing

source: Aku datang karena ada
en: I’ve come here because

source: JIKA KEDUA
en: Once both of you

source: AKU BELUM SIAP DITINGGAL BERDUA SAJA DENGAN CHIARA!
en: I’m not ready to be alone with her!

source: Dua orang berapi-api.
en: the two contenders.

source: mentor di OSIS.
en: mentor the current members.

source: KEMARIN!??
en: yesterday?!

source: …Tapi,
en: but...

source: BURUNG HANTU!
en: the Owl!

source: SRUK!
en: rub

source: KEBELET!!
en: to pee!!!

source: Tapi anggap saja ini sedikit pembalasanku untuk mereka.
en: well, I should just think of this as a prank.

source: TAPI INI ADALAH
en: But, it’s

source: ORANG LAIN,
en: easily.

source: SI KEMBAR DANISWARA.
en: the daniswara twins

source: AKU HARAP KAKAK BISA MENGERTI.
en: I hope you can understand.

source: MAU MENGEJEKKU
en: just to pick on me,

source: MEMBUATKU BERPIKIR.
en: think.

source: UNTUK SAAT INI, STRATEGI "MENGHINDAR" HARUS TETAP DILAKUKAN OLEH CHIARA.
en: chiara needs to keep "dodging" for the time being.

source: Terlalu cepat untuk menyimpulkan kalau situasi ini sama seperti Erlangga.
en: it’s too soon to say that we’re in the same situation now.

source: UGH, DIA
en: Ugh, she’s

source: PUNYA BISNIS ILLEGAL, KEBAL HUKUM...
en: ...owning illegal businesses, standing above the law...

source: APA MAU
en: why don’t you look at yourself

source: TIBA!
en: this!

source: PERCAYA DENGANKU,
en: would trust me

source: IBU SEBENARNYA
en: you already

source: K-Kalau begitu,
en: okay then...

source: pembicaraan mereka.
en: their conversation.

source: ORANG ITU PASTI
en: i don’t think

source: APA SIH INI!??
en: is going on?!

source: ada hubungannya
en: this has something to

source: RUMOR!
en: of course!

source: KAMU HANYALAH MURID
en: you were just an ordinary student.

source: BLACKMAIL KETUA,
en: you.

source: OSIS DENGAN DETAIL
en: in

source: HU
en: Sob

source: Seragam tidak lengkap.
en: he hasn’t worn a proper uniform.

source: Kehadiran Kevin dimunculkan sesedikit mungkin di mata Ezra.
en: he makes sure kevin’s annoying face is out of the frame.

source: GERIK KETUA.
en: on you.

source: APA-APAAN INI??
en: what’s going on here?!

source: DIA TIDAK AKAN
en: He has nothing

source: CERITAMU TADI
en: You’re

source: Kami Berhasil!!
en: we did it!!!

source: …Aku tidak pernah menyangka kalau aku akan merasakan sendiri situasi penculikan seperti ini!!
en: I never thought it would really happen to me!!!

source: SEMENYEDIHKAN ITU,
en: that pathetic!

source: KARENA AKHIRNYA AKU MENEMUKAN PERTEMANAN YANG TULUS.
en: ...because I’ve finally found some real friends.

source: Umm…S-Sekarang masih belum…
en: um... not yet...

source: Kalian hebat juga!
en: you’re awesome!

source: KALAU LEO BUKAN
en: that Leo

source: IBU… TAPI SAYA TIDAK
en: I’m

source: Cepat lakukan saja!!
en: just do it!!!

source: TAPI ADA KASUS-
en: However, there are some

source: SITUASI MACAM
en: What am I getting myself

source: MENGATAKANNYA
en: if you say it

source: INI GILA,
en: crazy,

source: BENAR JUGA, KENAPA YA?
en: how?

source: TERNYATA MEMANG
en: we came to the conclusion that Leo was

source: MUDA, DAN SAYA MURID
en: way too young for you, and I’m your student... but,

source: A-Ada hal yang darurat, t-tapi um…
en: there’s an emergency, b-but um....

source: DENGANNYA!
en: with her!

source: EHEM
en: ahem

source: MEMILIHMU, MURID
en: pick you,

source: EZRA DAN
en: Ezra

source: E-Eh…
en: w-what?!

source: BILANG KEPSEK
en: say that the headmaster

source: main drama ya??
en: a play, you know?!

source: KEJADIAN INI,
en: uncover.

source: Tidak punya niat buruk.
en: I had no ill intentions.

source: CHIARA.
en: must be chiara.

source: DAN DARIMANA
en: How did

source: Ada
en: I’ve got

source: Tipe yang
en: a

source: KEPIKIRAN SOAL CHIARA
en: Chiara pops up in my mind

source: CHIARA TIDAK
en: Chiara has

source: SAYANGNYA,
en: Unfortunately,

source: Aku punya sebuah kejutan yang ingin kutunjukkan di festival itu."
en: I have a surprise to show you there.”

source: Orang itu benar-benar gila, berencana untk membuat ulah di keramaian begini…
en: they must be crazy to plan for chaos in a place like this.

source: APA LAGI?
en: say, Leo?

source: …HA?
en: ...huh?

source: Seperti peliharaan
en: He’s like

source: UNTUK MEMINTA BANTUAN
en: she ask for chiara’s help

source: HAL INI SEORANG
en: this

source: …BENAR.
en: Right.

source: BUKANNYA ANEH DIA BISA PUNYA TEMPAT PERSEMBUNYIAN SEPERTI ITU DI SEKOLAH?
en: isn’t it strange that he has a hiding place in this school?

source: BLA...
en: blah

source: KAK EZRA??
en: Ezra?!

source: BENAR, BU NINA…
en: Yes...

source: PERCAYA ITU TERBANGUN
en: build trust,

source: OSIS SALING
en: each other’s

source: Kamu yang namanya Chiara Chandrawijaya, ya?
en: you’re chiara chandrawijaya, aren’t you?

source: aku akan memanggil
en: I will call for

source: APA TUJUAN KALIAN
en: Why did the school

source: PERPECAHAN.
en: dissolutions.

source: DIA BISA..!?
en: he?!

source: JANGAN KAGET
en: surprised,

source: Aku jadi
en: I feel

source: MEMBUAT KITA
en: the school’s morality

source: KETUA OSIS!??
en: of OSIS?!

source: BANYAK YANG BILANG ITU KEKUATAN DARI KELUARGA PRANADIPA, TAPI AKU RASA BUKAN ITU SAJA.
en: they say it’s because of the power of the pranadipa family, but I believe there’s more to it.

source: SOAL KEJADIAN
en: all

source: MENDEKATI GEBETAN,
en: the girl you like,

source: DI MANA ANGGOTA
en: the members know about

source: KELUARGAMU SEPERTI MAFIA?
en: that you’re family was like a mafia?

source: E-EH?
en: h-huh?

source: BU NINA!
en: Ms. Nina!

source: WAH, GOSIP
en: Whoa... things

source: EVA!
en: Ms. Eva!

source: Walaupun satu gen, tapi tetap saja 'kan?
en: despite the fact that their genes are similar...

source: MENUNGGU BALASAN
en: need to know

source: PAHAM APA YANG
en: what’s

source: KUALIFIKASI SEBAGAI
en: who’s the most qualified

source: Lalu tadi juga kamu seperti mengasingkan dia dari OSIS
en: and it seemed like you just alienate her from the other members.

source: Wah, di luar anginnya kencang juga!
en: whoa, it’s so windy out here!

source: KAMU BICARA DENGANKU
en: You usually don’t like to talk to me

source: G-Gawat, apa mungkin talinya terlalu kasar??
en: oh no! is the rope too rough?

source: BISAKAH KAU
en: Can’t you

source: DARI IBU SENDIRI…
en: from you...

source: PERASAAN ITU.
en: that feeling.

source: EH!?
en: What?!

source: YANG SANGAT PENTING
en: that you told me about was

source: EZRA,
en: to him.

source: DAN SATU JUNIOR.
en: and one junior.

source: LEO MENUTUPINYA
en: Leo had been trying to cover this up

source: Permisi ya…
en: I’m taking these off...

source: (namun Chiara taunya
en: (However, chiara thinks

source: DAN TERNYATA KELUARGA SANJAYA MEMILIKI KAITAN DENGAN ARDHAN?
en: ...and discovered that his family had ties to ardhan, correct?

source: KARENA KAU INGIN
en: because you wanna

source: …Semua ini keslahan saya.
en: it’s all my fault...

source: SOAL KETUA LEO,
en: something,

source: INFORMASINYA, SEMAKIN
en: like this

source: DAN AKU HARUS
en: Moreover, I still need

source: SEBELUMNYA,
en: right?

source: Itu seperti memang ruangan khusus...
en: it does look like a special place...

source: Ah iya, maaf saya lupa Pak,
en: Oh, sorry, where are my manners.

source: SEOLAH ITU TAK
en: be

source: PROPERTI TEATER,
en: props...

source: PERHATIAN.
en: an announcement.

source: ITU!??
en: huh?!

source: KAMU.
en: of you.

source: KAU JUGA
en: You weren’t any

source: Seperti biasa, kepsek selalu membuat hati lebih tenang!
en: as always, the principal makes us feel better!

source: MENDENGARNYA
en: it

source: bohong,
en: stop messing

source: ADA APA??
en: Is he okay?

source: SEPERTINYA KALIAN MENJADIKAN SAYA, SI MURID BEASISWA, SEBAGAI "UMPAN".
en: you’ve been using me, the model student, as a “bait.”

source: MANA?
en: the place?

source: …Selama ini aku tidak pernah memikirkan adanya kemungkinan itu dengan siapapun dari sekolah ini.
en: I’d never thought that any boys in the school will like me.

source: KAU MAU DALIH
en: do you have anything to

source: I-INI JUGA SALAH SATUNYA KENAPA BAPAK MENCURIGAKAN!!
en: th-this is also one of the reasons why we suspect you!

source: HEI.
en: hey.

source: ITU TIDAK SEPENUHNYA
en: weren’t completely

source: apapun yang kau mau.
en: want.

source: SANGAT DISAYANGKAN
en: letting go of someone

source: SEMUA KEPADA
en: about

source: KEMARIN DIA BERTENGKAR
en: with that senior

source: NGGAK ADA YANG MENARIK DARI CHIARA!!!
en: I’m not interested in her at all!

source: TENTU.
en: Sure.

source: EEH!??
en: Huh?!

source: SEKARANG KAMU KETERLALUAN.
en: and now you’re just being rude.

source: EZRA… KAKAK
en: why are

source: AKAN MEMARAHI
en: you’d be

source: PAK NEV!!
en: mr. nevada!

source: KEUNTUNGAN UNTUK
en: I’m just a scholarship student

source: DIA PERLU WAKTU
en: She needs time to

source: DAN BERTANGGUNG
en: and reliable

source: BUKANLAH
en: isn’t

source: RUMPI SAMPAI
en: are

source: BUTA MEMPERCAYAI
en: their trust in

source: ...BEGITULAH.
en: so that’s all there is to it.

source: Kalau ada apa-apa,
en: If something happens,

source: JADI, INFORMASI
en: So,

source: LAGI MASALAH
en: came

source: BERIKAN RUANG
en: Give her

source: BERJAGA-JAGA.
en: stand guard

source: ...KAU YAKIN PERMINTAANMU INI KARENA OSIS, BUKAN KARENA ALASAN PRIBADI?
en: are you sure this request is for osis and not for personal gain?

source: TIDAKKAH HAL INI
en: Shouldn’t we question

source: OKE, KAK.
en: see you.

source: TAPI SIAPA
en: But,

source: banyak tanya.
en: questions.

source: PIHAKMU.
en: side.

source: Padahal sebenarnya ada banyak faktor, 'kan.
en: there are other factors, right?

source: DIA ADA URUSAN
en: he had an

source: Ini benar-benar gila, aku yakin ini ada hubungannya dengan OSIS!
en: this is outrageous! I’m sure it’s related to the OSIS!

source: MENGENAL, BUKAN?
en: know about each other’s identities...

source: punya teman untuk
en: any friends,

source: KALAU KAU SUKA
en: to confess your feelings

source: ADA HARI TENANG
en: thing as tranquility

source: Kakak tidak boleh menganggap remeh, begini-begini Cantika tahu banyak loh!
en: don’t underestimate me. I know a lot of stuff.

source: Jangan lari-lari di koridor.
en: don’t run in the hallway.

source: MELAKUKANNYA
en: it

source: MAAF KARENA MENYEMBUNYIKAN INI DARIMU.
en: sorry for keeping you in the dark all this time.

source: Bahkan aku
en: why are you still

source: …BAIK,
en: ...affirmative,

source: Apa aku
en: D-did

source: PERGI KE SANA
en: before

source: ADIK DARI KETUA LEO,
en: Leo’s sister!

source: SEPERTIMU.
en: you?

source: SUDAH SAYA BILANG NGGAK BEGITU!!
en: I told you, it was a misunderstanding!

source: DIA PINTAR MEMUTARBALIK PERKATAAN DAN AGAK LICIK.
en: he’s good at contradicting facts and a bit cunning.

source: SEMUA INI
en: This is

source: BERSAMA MEREKA?
en: those people?

source: SAJA SUDAH CUKUP
en: that Naomi knows about this!

source: AKU BISA
en: I can

source: KAU SEDANG
en: you’re thinking

source: ...KHAWATIR KAMU AKAN MENINGGALKAN OSIS SETELAH TAHU SEMUANYA,
en: ...that you would leave osis after knowing the truth,

source: dengan Wakatos
en: do with the

source: SEMENTARA ITU
en: Meanwhile,

source: JUGA HARUS PERCAYA
en: should I put

source: D-DAN BU NINA
en: Mrs. Nina has also requested

source: HOI, JANGAN
en: Huh?! What

source: PARTNER -KU SELALU
en: my own partner,

source: DAN SAAT HAL INI DIKETAHUI ORANG-ORANG,
en: once this begin to spread...

source: YANG LIHAT BILANG SUASANA
en: after they fought,

source: YA,
en: yes,

source: BENAR INGIN
en: wanna

source: JAGO AKTING!
en: actor!

source: DATANG KEMARI SAAT
en: inconvenience.

source: TERHADAP WAKIL
en: towards

source: Tapi bagaimana bisa aku melakukan itu sementara anggota OSIS yang lain ikut membantu?
en: how can I do that while the other members are helping?

source: YANG BAIK.
en: actor.

source: 12 TIDAK LAGI MENJADI
en: no longer considered active members

source: PADA CHIARA…
en: to Chiara.

source: Turunan gengsi dari Nevada.
en: nevada’s prestige showing up

source: BUKAN PENGALAMANKU
en: my experiences with

source: AKU BILANG
en: you

source: YAH...
en: well...

source: TANPA MEMIKIRKAN
en: I should’ve thought
